Dictatora0/26-term3-pz-f103/2023302111204-李富麟/5.22/mobile_mqtt_f103/APP/esp8266/wifi_function.c
#include "wifi_function.h"
#include "wifi_config.h"
#include "SysTick.h"
#include "led.h"
#include "esp8266_mqtt_config.h"
#include <string.h> 
#include <stdio.h>  
#include <stdbool.h>


#include <stdint.h>



// 定义单连接ID，假设为0，具体根据实际情况
#define Single_ID 0

static u32 s_esp_cmd_seq = 0;

static char esp_ascii_upper(char c)
{
    if ((c >= 'a') && (c <= 'z')) {
        return (char)(c - ('a' - 'A'));
    }
    return c;
}

static bool esp_icase_contains(const char *src, const char *token)
{
    const char *p;
    const char *s;
    const char *t;
    char cs;
    char ct;

    if ((src == 0) || (token == 0) || (*token == '\0')) {
        return false;
    }

    for (p = src; *p != '\0'; ++p) {
        s = p;
        t = token;
        while ((*s != '\0') && (*t != '\0')) {
            cs = esp_ascii_upper(*s);
            ct = esp_ascii_upper(*t);
            if (cs != ct) {
                break;
            }
            ++s;
            ++t;
        }
        if (*t == '\0') {
            return true;
        }
    }

    return false;
}

static void esp_log_rx_hex(u32 cmd_id, const char *buf, u16 len)
{
    u16 i;
    u16 show_len;

    if ((buf == 0) || (len == 0U)) {
        return;
    }

    show_len = len;
    if (show_len > 48U) {
        show_len = 48U;
    }

    PC_Usart("[ESP_CMD %lu] RX_HEX(%u):", (unsigned long)cmd_id, (unsigned int)show_len);
    for (i = 0; i < show_len; ++i) {
        PC_Usart(" %02X", (unsigned char)buf[i]);
    }
    PC_Usart("\r\n");
}

static void esp_mqtt_diag_probe(const char *host, const char *port)
{
    char cCmd[160];
    bool tcp_ok;

    if ((host == 0) || (port == 0)) {
        return;
    }

    PC_Usart("[MQTT_DIAG] broker=%s:%s\r\n", host, port);
    ESP8266_Cmd("AT+CIFSR", "OK", "STAIP", 1500);

    sprintf(cCmd, "AT+PING=\"%s\"", host);
    ESP8266_Cmd(cCmd, "OK", "+PING", 5000);

    sprintf(cCmd, "AT+CIPSTART=\"TCP\",\"%s\",%s", host, port);
    tcp_ok = ESP8266_Cmd(cCmd, "CONNECT", "OK", 6000);
    if (tcp_ok) {
        ESP8266_Cmd("AT+CIPCLOSE", "OK", "CLOSED", 2000);
    } else {
        PC_Usart("[MQTT_DIAG] TCP probe failed\r\n");
    }

    ESP8266_Cmd("AT+MQTTCONN?", "OK", "+MQTTCONN", 1000);
}

static void esp8266_send_raw_line(const char *s)
{
    if (s == 0) {
        return;
    }

    while (*s != 0) {
        USART_SendData(USART3, (u8)*s++);
        while (USART_GetFlagStatus(USART3, USART_FLAG_TXE) == RESET);
    }

    USART_SendData(USART3, (u8)0x0D);
    while (USART_GetFlagStatus(USART3, USART_FLAG_TXE) == RESET);
    USART_SendData(USART3, (u8)0x0A);
    while (USART_GetFlagStatus(USART3, USART_FLAG_TXE) == RESET);
}

static void esp8266_send_raw_bytes(const char *buf, u16 len)
{
    u16 i;

    if ((buf == 0) || (len == 0U)) {
        return;
    }

    for (i = 0; i < len; ++i) {
        USART_SendData(USART3, (u8)buf[i]);
        while (USART_GetFlagStatus(USART3, USART_FLAG_TXE) == RESET);
    }
}

static bool esp8266_wait_reply(u32 cmd_id, const char *reply1, const char *reply2, u32 waittime)
{
    u32 elapsed = 0;
    u16 rx_len;
    bool matched = false;
    bool seen_any = false;

    if ((reply1 == 0) && (reply2 == 0)) {
        PC_Usart("[ESP_CMD %lu] no-reply mode\r\n", (unsigned long)cmd_id);
        return true;
    }

    while (elapsed < waittime) {
        delay_ms(10);
        elapsed += 10;

        if (strEsp8266_Fram_Record.InfBit.FramFinishFlag) {
            rx_len = strEsp8266_Fram_Record.InfBit.FramLength;
            strEsp8266_Fram_Record.Data_RX_BUF[rx_len] = '\0';
            seen_any = true;

            if ((reply1 != 0) && (strstr(strEsp8266_Fram_Record.Data_RX_BUF, reply1) || esp_icase_contains(strEsp8266_Fram_Record.Data_RX_BUF, reply1))) {
                matched = true;
            }
            if ((reply2 != 0) && (strstr(strEsp8266_Fram_Record.Data_RX_BUF, reply2) || esp_icase_contains(strEsp8266_Fram_Record.Data_RX_BUF, reply2))) {
                matched = true;
            }

            if ((strstr(strEsp8266_Fram_Record.Data_RX_BUF, "ERROR") != 0) || esp_icase_contains(strEsp8266_Fram_Record.Data_RX_BUF, "error")) {
                PC_Usart("[ESP_CMD %lu] RX has ERROR\r\n", (unsigned long)cmd_id);
            }
            if ((strstr(strEsp8266_Fram_Record.Data_RX_BUF, "busy") != 0) || esp_icase_contains(strEsp8266_Fram_Record.Data_RX_BUF, "busy")) {
                PC_Usart("[ESP_CMD %lu] RX has busy\r\n", (unsigned long)cmd_id);
            }

            PC_Usart("[ESP_CMD %lu] RX(%u ms,len=%u): %s\r\n",
                     (unsigned long)cmd_id,
                     (unsigned int)elapsed,
                     (unsigned int)rx_len,
                     strEsp8266_Fram_Record.Data_RX_BUF);
            esp_log_rx_hex(cmd_id, strEsp8266_Fram_Record.Data_RX_BUF, rx_len);

            if (matched) {
                strEsp8266_Fram_Record.InfBit.FramLength = 0;
                strEsp8266_Fram_Record.InfBit.FramFinishFlag = 0;
                return true;
            }

            strEsp8266_Fram_Record.InfBit.FramLength = 0;
            strEsp8266_Fram_Record.InfBit.FramFinishFlag = 0;
        }
    }

    if (seen_any) {
        PC_Usart("[ESP_CMD %lu] TIMEOUT unmatched after RX (%lu ms)\r\n", (unsigned long)cmd_id, (unsigned long)waittime);
    } else if (strEsp8266_Fram_Record.InfBit.FramLength > 0) {
        strEsp8266_Fram_Record.Data_RX_BUF[strEsp8266_Fram_Record.InfBit.FramLength] = '\0';
        PC_Usart("[ESP_CMD %lu] TIMEOUT partial: %s\r\n", (unsigned long)cmd_id, strEsp8266_Fram_Record.Data_RX_BUF);
        esp_log_rx_hex(cmd_id, strEsp8266_Fram_Record.Data_RX_BUF, strEsp8266_Fram_Record.InfBit.FramLength);
    } else {
        PC_Usart("[ESP_CMD %lu] TIMEOUT no response (%lu ms)\r\n", (unsigned long)cmd_id, (unsigned long)waittime);
    }

    strEsp8266_Fram_Record.InfBit.FramLength = 0;
    strEsp8266_Fram_Record.InfBit.FramFinishFlag = 0;
    return false;
}
/*
 * 函数名：ESP8266_Choose
 * 描述  ：使能/禁用WF-ESP8266模块
 * 输入  ：enumChoose = ENABLE，使能模块
 *         enumChoose = DISABLE，禁用模块
 * 返回  : 无
 * 调用  ：被外部调用
 */
void ESP8266_Choose ( FunctionalState enumChoose )
{
	if ( enumChoose == ENABLE )
		ESP8266_CH_HIGH_LEVEL();
	
	else
		ESP8266_CH_LOW_LEVEL();
	
