Dictatora0/26-term3-pz-f103/2023302111204-李富麟/5.22/mobile_mqtt_f103/APP/esp8266/wifi_function.c
}


/*
 * 函数名：ESP8266_Rst
 * 描述  ：重启WF-ESP8266模块
 * 输入  ：无
 * 返回  : 无
 * 调用  ：被ESP8266_AT_Test调用
 */
void ESP8266_Rst ( void )
{
	#if 0
	 ESP8266_Cmd ( "AT+RST", "OK", "ready", 2500 );   	
	
	#else
	 ESP8266_RST_LOW_LEVEL();
	 delay_ms ( 500 ); 
	 ESP8266_RST_HIGH_LEVEL();
	 
	#endif

}


/*
 * 函数名：ESP8266_AT_Test
 * 描述  ：对WF-ESP8266模块进行AT测试启动
 * 输入  ：无
 * 返回  : 无
 * 调用  ：被外部调用
 */
void ESP8266_AT_Test ( void )
{
    u8 i;

    ESP8266_RST_HIGH_LEVEL();
    delay_ms(300);
    PC_Usart("[ESP_AT] probing...\r\n");

    for (i = 0; i < 6; i++)
    {
        if (ESP8266_Cmd("AT", "OK", "ready", 500))
        {
            PC_Usart("[ESP_AT] ok on try %d\r\n", i + 1);
            return;
        }

        if ((i == 1U) || (i == 3U))
        {
            PC_Usart("[ESP_AT] pulse reset\r\n");
            ESP8266_Rst();
            delay_ms(500);
        }
        else
        {
            delay_ms(200);
        }
    }

    PC_Usart("[ESP_AT] failed after retries\r\n");
}


/*
 * 函数名：ESP8266_Cmd
 * 描述  ：对WF-ESP8266模块发送AT指令
 * 输入  ：cmd，待发送的指令
 *         reply1，reply2，期待的响应，为NULL表不需响应，两者为或逻辑关系
 *         waittime，等待响应的时间
 * 返回  : 1，指令发送成功
 *         0，指令发送失败
 * 调用  ：被外部调用
 */
bool ESP8266_Cmd ( char * cmd, char * reply1, char * reply2, u32 waittime )
{
    u32 cmd_id;

    cmd_id = ++s_esp_cmd_seq;
    strEsp8266_Fram_Record.InfBit.FramLength = 0;
    strEsp8266_Fram_Record.InfBit.FramFinishFlag = 0;

    PC_Usart("[ESP_CMD %lu] TX: %s\r\n", (unsigned long)cmd_id, cmd);
    esp8266_send_raw_line(cmd);

    return esp8266_wait_reply(cmd_id, reply1, reply2, waittime);
}


/*
 * 函数名：ESP8266_Net_Mode_Choose
 * 描述  ：选择WF-ESP8266模块的工作模式
 * 输入  ：enumMode，工作模式
 * 返回  : 1，选择成功
 *         0，选择失败
 * 调用  ：被外部调用
 */
bool ESP8266_Net_Mode_Choose ( ENUM_Net_ModeTypeDef enumMode )
{
	switch ( enumMode )
	{
		case STA:
			return ESP8266_Cmd ( "AT+CWMODE=1", "OK", "no change", 2500 ); 
		
	  case AP:
		  return ESP8266_Cmd ( "AT+CWMODE=2", "OK", "no change", 2500 ); 
		
		case STA_AP:
		  return ESP8266_Cmd ( "AT+CWMODE=3", "OK", "no change", 2500 ); 
		
	  default:
		  return false;
  }
	
}


/*
 * 函数名：ESP8266_JoinAP
 * 描述  ：WF-ESP8266模块连接外部WiFi
 * 输入  ：pSSID，WiFi名称字符串
 *       ：pPassWord，WiFi密码字符串
 * 返回  : 1，连接成功
 *         0，连接失败
 * 调用  ：被外部调用
 */
bool ESP8266_JoinAP ( char * pSSID, char * pPassWord )
{
	char cCmd [120];

	sprintf ( cCmd, "AT+CWJAP=\"%s\",\"%s\"", pSSID, pPassWord );
	
	return ESP8266_Cmd ( cCmd, "OK", NULL, 20000 );
	
}

/*
 * 函数名：ESP8266_BuildAP
 * 描述  ：WF-ESP8266模块创建WiFi热点
 * 输入  ：pSSID，WiFi名称字符串
 *       ：pPassWord，WiFi密码字符串
 *       ：enunPsdMode，WiFi加密方式代号字符串
 * 返回  : 1，创建成功
 *         0，创建失败
 * 调用  ：被外部调用
 */
bool ESP8266_BuildAP ( char * pSSID, char * pPassWord, char * enunPsdMode )
{
	char cCmd [120];

	sprintf ( cCmd, "AT+CWSAP=\"%s\",\"%s\",1,%s", pSSID, pPassWord, enunPsdMode );
	
	return ESP8266_Cmd ( cCmd, "OK", 0, 1000 );
	
}


/*
 * 函数名：ESP8266_Enable_MUSART3_printfultipleId
 * 描述  ：WF-ESP8266模块启动多连接
 * 输入  ：enumEnUnvarnishTx，配置是否多连接
 * 返回  : 1，配置成功
 *         0，配置失败
 * 调用  ：被外部调用
 */
bool ESP8266_Enable_MultipleId ( FunctionalState enumEnUnvarnishTx )
{
	char cStr [20];
	
	sprintf ( cStr, "AT+CIPMUX=%d", ( enumEnUnvarnishTx ? 1 : 0 ) );
	
	return ESP8266_Cmd ( cStr, "OK", 0, 500 );
	
}


/*
 * 函数名：ESP8266_Link_Server
 * 描述  ：WF-ESP8266模块连接外部服务器
 * 输入  ：enumE，网络协议
 *       ：ip，服务器IP字符串
 *       ：ComNum，服务器端口字符串
 *       ：id，模块连接服务器的ID
 * 返回  : 1，连接成功
 *         0，连接失败
 * 调用  ：被外部调用
 */
bool ESP8266_Link_Server ( ENUM_NetPro_TypeDef enumE, char * ip, char * ComNum, ENUM_ID_NO_TypeDef id)
{
	char cStr [100] = { 0 }, cCmd [120];

  switch (  enumE )
  {
		case enumTCP:
		  sprintf ( cStr, "\"%s\",\"%s\",%s", "TCP", ip, ComNum );
		  break;
		
		case enumUDP:
		  sprintf ( cStr, "\"%s\",\"%s\",%s", "UDP", ip, ComNum );
		  break;
		
		default:
			break;
  }

  if ( id < 5 )
    sprintf ( cCmd, "AT+CIPSTART=%d,%s", id, cStr);

  else
	  sprintf ( cCmd, "AT+CIPSTART=%s", cStr );

	return ESP8266_Cmd ( cCmd, "OK", "ALREAY CONNECT", 500 );
	
}




/*
 * ESP8266_Link_MQTT
 * 描述  ：WF-ESP8266模块连接外部服务器
 * 输入  ：enumE，网络协议
 *       ：ip，服务器IP字符串
 *       ：ComNum，服务器端口字符串
 *       ：id，模块连接服务器的ID
 * 返回  : 1，连接成功
 *         0，连接失败
 * 调用  ：被外部调用
 */
bool ESP8266_Link_MQTT (  char * ip, char * ComNum, ENUM_ID_NO_TypeDef id)
{
	char cStr [100] = { 0 }, cCmd [120];
    bool ok;

    (void)id;
    PC_Usart("[MQTT_DIAG] MQTT connect start\r\n");
    ESP8266_Cmd("AT+MQTTCONN?", "OK", "+MQTTCONN", 1000);
    esp_mqtt_diag_probe(ip, ComNum);

	sprintf ( cStr, "\"%s\",%s",  ip, ComNum );
    sprintf ( cCmd, "AT+MQTTCONN=0,%s,0", cStr );
	ok = ESP8266_Cmd ( cCmd, "+MQTTCONNECTED", "OK", 30000 );
    if (!ok) {
        PC_Usart("[MQTT_DIAG] MQTTCONN failed\r\n");
        ESP8266_Cmd("AT+MQTTCONN?", "OK", "+MQTTCONN", 1000);
        ESP8266_Cmd("AT+MQTTCLEAN=0", "OK", "ERR CODE", 1500);
        ESP8266_Cmd("AT+MQTTCONN?", "OK", "+MQTTCONN", 1000);
    }
	return ok;
	
}

/*
 * ESP8266_Set_MQTT_User
 * 描述  ：set MQTT user

 * 返回  : 1，连接成功
 *         0，连接失败
 * 调用  ：被外部调用
 */
bool ESP8266_Set_MQTT_User ()
{
	char cCmd [160];
    /* MQTT over TCP，不使用用户名和密码 */
	sprintf ( cCmd, "AT+MQTTUSERCFG=0,1,\"%s\",\"\",\"\",0,0,\"\"", MQTT_CLIENT_ID );
	return ESP8266_Cmd ( cCmd, "OK", "ALREAY CONNECT", 500 );
}


bool ESP8266_Set_MQTT_ConnCfg ( void )
{
    char cCmd [160];
    sprintf ( cCmd, "AT+MQTTCONNCFG=0,120,0,\"\",\"\",0,0" );
    return ESP8266_Cmd ( cCmd, "OK", NULL, 1000 );
}


/*
 * ESP8266_Set_MQTT_public
 * 描述  ：set MQTT public

 * 返回  : 1，连接成功
 *         0，连接失败
 * 调用  ：被外部调用
 */
bool ESP8266_Set_MQTT_Public (const char * topicId ,const char * val)
{
	char cCmd [220];
    u16 payload_len;
    u32 cmd_id;

    if ((topicId == 0) || (val == 0)) {
        return false;
    }

    payload_len = (u16)strlen(val);
	sprintf ( cCmd, "AT+MQTTPUBRAW=0,\"%s\",%u,0,0", topicId, (unsigned int)payload_len );
    if (strlen(cCmd) >= (sizeof(cCmd) - 2U)) {
        return false;
    }

    cmd_id = ++s_esp_cmd_seq;
    strEsp8266_Fram_Record.InfBit.FramLength = 0;
    strEsp8266_Fram_Record.InfBit.FramFinishFlag = 0;

    PC_Usart("[ESP_CMD %lu] TX: %s\r\n", (unsigned long)cmd_id, cCmd);
    esp8266_send_raw_line(cCmd);
    if (!esp8266_wait_reply(cmd_id, ">", NULL, 2000)) {
        PC_Usart("[MQTT] raw publish prompt failed\r\n");
        return false;
    }

    PC_Usart("[ESP_CMD %lu] TX_RAW(len=%u)\r\n", (unsigned long)cmd_id, (unsigned int)payload_len);
    esp8266_send_raw_bytes(val, payload_len);

	return esp8266_wait_reply(cmd_id, "+MQTTPUB:OK", "OK", 6000 );
}


//su  esp8266 sub mqtt topic function ，parameter is topicId & qos  ,include  parameter declaration 
bool ESP8266_Set_MQTT_Sub (const  char * topicId,const  char * qos)
{
	char cStr [100] = { 0 }, cCmd [120];
	//construct string: AT+MQTTSUB=0,"topic911",1,0
	sprintf ( cCmd, "AT+MQTTSUB=0,\"%s\",%s", topicId, qos );
	PC_Usart("发送订阅指令: %s\r\n", cCmd); // 添加日志输出
	return ESP8266_Cmd (cCmd, "OK", "ALREADY SUBSCRIBE", 1500);
}





