Dictatora0/26-term3-pz-f103/2023302111204-李富麟/5.22/mobile_mqtt_f103/APP/esp8266/wifi_function.c
	}
	
	
	// write english PC_Usart ( "\r\n请在网络调试助手发送字符串\r\n" );
	PC_Usart ( "\r\nPlease send strings in the network debugging assistant\r\n" );
	while (1)
	{
	  pStr = ESP8266_ReceiveString ( DISABLE );
		PC_Usart ( "%s", pStr );
	}

}





/*
 * 函数名：ESP8266_STA_TCP_Client_Single
 * 描述  ：ESP8266模块进行STA TCP Client测试（单连接模式）
 * 输入  ：无
 * 返回  : 无
 * 调用  ：被外部调用
 */

// 假设需要的头文件已经包含，这里示例包含常用的一些


void ESP8266_STA_TCP_Client_Single ( void )
{
    // 固定配置
    const char* ssid = "x";                
    const char* password = "12345678";        
    const char* server_ip = "192.168.254.195"; 
    const char* server_port = "8080";        
    
    // **函数体开头：声明所有变量**
    u8 wifi_retry = 0;
    bool wifi_connected = false;
    u8 server_retry = 0;
    bool server_connected = false;
    const char* test_data;
    u32 data_len;

    // 启用模块
    PC_Usart("\r\nInitializing ESP8266...\r\n");
    ESP8266_Choose(ENABLE);
    ESP8266_AT_Test();
    
    // 设置STA模式
    PC_Usart("\r\nConnecting to WiFi: %s...\r\n", ssid);
    if (!ESP8266_Net_Mode_Choose(STA)) {
        PC_Usart("[ESP] set STA mode failed\r\n");
        return;
    }
    
    // WiFi连接循环（变量已在开头声明，无需重复）
    while (wifi_retry < 3 && !wifi_connected) {
        wifi_connected = ESP8266_JoinAP((char*)ssid, (char*)password);
        if (!wifi_connected) {
            PC_Usart("\r\nWiFi connection failed, retrying %d/3...\r\n", wifi_retry+1);
            wifi_retry++;
            delay_ms(1000);
        }
    }
    
    // 单连接模式
    //ESP8266_Enable_MultipleId(DISABLE); // 关闭多连接
    
    // 连接服务器
    PC_Usart("\r\nConnecting to server: %s:%s...\r\n", server_ip, server_port);
    while (server_retry < 3 && !server_connected) {
        // 强制转换枚举类型为uint8_t（若函数参数为uint8_t）
        server_connected = ESP8266_Link_Server((uint8_t)enumTCP, (char*)server_ip, (char*)server_port, 9); // 假设Single_ID=0
        if (!server_connected) {
            PC_Usart("\r\nServer connection failed, retrying %d/3...\r\n", server_retry+1);
            server_retry++;
            delay_ms(1000);
        }
    }
    
    // 发送数据（变量已在开头声明）
    test_data = "Hello from ESP8266!";
    data_len = strlen(test_data);
    PC_Usart("\r\nSending test data: %s\r\n", test_data);
    if (ESP8266_SendString(DISABLE, (char*)test_data, data_len, 0)) { // 假设Single_ID=0
        PC_Usart("\r\nData sent successfully!\r\n");
    } else {
        PC_Usart("\r\nFailed to send data!\r\n");
    }
    
    // 接收循环
    while (1) { /* ... */ }
}





/*
 * 函数名：ESP8266_STA_TCP_Client_MQTT
 * 描述  ：ESP8266模块进行STA TCP Client测试（单连接模式）
 * 输入  ：无
 * 返回  : 无
 * 调用  ：被外部调用
 */

// 假设需要的头文件已经包含，这里示例包含常用的一些


void ESP8266_STA_TCP_Client_MQTT ( void )
{
    const char* ssid = WIFI_SSID;
    const char* password = WIFI_PASSWORD;
    const char* mqtt_host = MQTT_HOST;
    const char* mqtt_port = MQTT_PORT_STR;
    const char* sub_topic = MQTT_TOPIC_CMD;
    const char* pub_topic = MQTT_TOPIC_ACK;
    char qos[] = "0";

    u8 retry = 0;
    bool ok = false;

    PC_Usart("\r\n=== ESP8266 MQTT Init ===\r\n");
    ESP8266_Choose(ENABLE);

    PC_Usart("[ESP] try baud=9600 (official default)\r\n");
    WiFi_SetUsart3Baud(9600);
    ESP8266_AT_Test();
    ok = ESP8266_Cmd("AT", "OK", NULL, 300);

    if (!ok) {
        PC_Usart("[ESP] no AT at 9600, try 115200...\r\n");
        PC_Usart("[ESP] try baud=115200\r\n");
        WiFi_SetUsart3Baud(115200);
        ESP8266_AT_Test();
        ok = ESP8266_Cmd("AT", "OK", NULL, 400);
    }

    if (!ok) {
        PC_Usart("[ESP] no response at 9600/115200.\r\n");
        PC_Usart("[ESP] If your module AT is 74880, use USB-UART first then set AT+UART_CUR=115200,8,1,0,0\r\n");
        return;
    }

    PC_Usart("[ESP] AT check OK\r\n");

    if (!ESP8266_Net_Mode_Choose(STA)) {
        PC_Usart("[ESP] set STA mode failed\r\n");
        return;
    }

    if (!ESP8266_Cmd("ATE0", "OK", NULL, 600)) {
        PC_Usart("[ESP] ATE0 failed (continue)\r\n");
    }
    if (!ESP8266_Cmd("AT+SYSLOG=1", "OK", NULL, 600)) {
        PC_Usart("[ESP] SYSLOG enable failed (continue)\r\n");
    }
    retry = 0;
    ok = false;
    while (retry < 3 && !ok) {
        ok = ESP8266_JoinAP((char*)ssid, (char*)password);
        if (!ok) {
            retry++;
            PC_Usart("[ESP] WiFi join failed, retry %d/3\r\n", retry);
            delay_ms(1200);
        }
    }
    if (!ok) {
        PC_Usart("[ESP] WiFi join failed after retries.\r\n");
        return;
    }
    PC_Usart("[ESP] WiFi connected\r\n");

    retry = 0;
    ok = false;
    while (retry < 3 && !ok) {
        ok = ESP8266_Set_MQTT_User();
        if (!ok) {
            retry++;
            PC_Usart("[MQTT] user cfg failed, retry %d/3\r\n", retry);
            delay_ms(800);
        }
    }
    if (!ok) {
        PC_Usart("[MQTT] user cfg failed after retries.\r\n");
        return;
    }
    PC_Usart("[MQTT] user cfg OK\r\n");

    retry = 0;
    ok = false;
    while (retry < 3 && !ok) {
        ok = ESP8266_Set_MQTT_ConnCfg();
        if (!ok) {
            retry++;
            PC_Usart("[MQTT] conn cfg failed, retry %d/3\r\n", retry);
            delay_ms(800);
        }
    }
    if (!ok) {
        PC_Usart("[MQTT] conn cfg failed after retries.\r\n");
        return;
    }
    PC_Usart("[MQTT] conn cfg OK\r\n");

    retry = 0;
    ok = false;
    while (retry < 3 && !ok) {
        ok = ESP8266_Link_MQTT((char*)mqtt_host, (char*)mqtt_port, Single_ID_0);
        if (!ok) {
            retry++;
            PC_Usart("[MQTT] conn failed, retry %d/3\r\n", retry);
            delay_ms(1200);
        }
    }
    if (!ok) {
        PC_Usart("[MQTT] conn failed after retries.\r\n");
        return;
    }
    PC_Usart("[MQTT] connected\r\n");

    retry = 0;
    ok = false;
    while (retry < 3 && !ok) {
        ok = ESP8266_Set_MQTT_Sub(sub_topic, qos);
        if (!ok) {
            retry++;
            PC_Usart("[MQTT] sub failed, retry %d/3\r\n", retry);
            delay_ms(800);
        }
    }
    if (!ok) {
        PC_Usart("[MQTT] sub failed after retries.\r\n");
        return;
    }
    PC_Usart("[MQTT] subscribed: %s\r\n", sub_topic);

