Dictatora0/26-term3-pz-f103/2023302111204-李富麟/5.22/mobile_mqtt_f103/APP/esp8266/wifi_function.c
    ESP8266_Set_MQTT_Public(pub_topic, "online");
    PC_Usart("MQTT ready. Sub topic: %s, Pub topic: %s\r\n", sub_topic, pub_topic);
}

bool ESP8266_MQTT_ExtractPayload(const char *src, char *payload, u16 payload_size)
{
    const char *first_comma;
    const char *second_comma;
    const char *third_comma;
    const char *start;
    const char *end;
    u16 copy_len;

    if ((src == NULL) || (payload == NULL) || (payload_size < 2U)) {
        return false;
    }

    first_comma = strchr(src, ',');
    if (first_comma == NULL) {
        return false;
    }

    second_comma = strchr(first_comma + 1, ',');
    if (second_comma == NULL) {
        return false;
    }

    third_comma = strchr(second_comma + 1, ',');
    if (third_comma == NULL) {
        return false;
    }

    start = third_comma + 1;
    while ((*start == ' ') || (*start == '"')) {
        start++;
    }

    end = start;
    while ((*end != '\0') && (*end != '\r') && (*end != '\n')) {
        end++;
    }
    while ((end > start) && ((*(end - 1) == ' ') || (*(end - 1) == '"'))) {
        end--;
    }

    copy_len = (u16)(end - start);
    if (copy_len >= payload_size) {
        copy_len = payload_size - 1U;
    }

    memcpy(payload, start, copy_len);
    payload[copy_len] = '\0';
    return true;
}

static void MQTT_HandleCommand(const char *payload)
{
    if (payload == NULL) {
        return;
    }

    if ((strcmp(payload, "LED1_ON") == 0) || (strcmp(payload, "LED_ON") == 0) || (strcmp(payload, "ON") == 0) || (strcmp(payload, "1") == 0)) {
        LED1 = 0;
        ESP8266_Set_MQTT_Public(MQTT_TOPIC_ACK, "LED_ON_OK");
    } else if ((strcmp(payload, "LED1_OFF") == 0) || (strcmp(payload, "LED_OFF") == 0) || (strcmp(payload, "OFF") == 0) || (strcmp(payload, "0") == 0)) {
        LED1 = 1;
        ESP8266_Set_MQTT_Public(MQTT_TOPIC_ACK, "LED_OFF_OK");
    } else if (strcmp(payload, "PING") == 0) {
        ESP8266_Set_MQTT_Public(MQTT_TOPIC_ACK, "PONG");
    } else {
        ESP8266_Set_MQTT_Public(MQTT_TOPIC_ACK, "UNKNOWN_CMD");
    }
}

void ESP8266_MQTT_Task(void)
{
    char *rx;
    char payload[128];

    rx = ESP8266_ReceiveString(DISABLE);
    if (rx == NULL) {
        return;
    }

    PC_Usart("%s", rx);

    if (strstr(rx, "+MQTTSUBRECV:") != NULL) {
        if (ESP8266_MQTT_ExtractPayload(rx, payload, sizeof(payload))) {
            PC_Usart("MQTT payload: %s\r\n", payload);
            MQTT_HandleCommand(payload);
        }
    } else if (strstr(rx, "+MQTTDISCONNECTED:") != NULL) {
        PC_Usart("MQTT disconnected, trying reconnect...\r\n");
        ESP8266_STA_TCP_Client_MQTT();
    }
}


/*
 * 函数名：ESP8266_AP_TCP_Server
 * 描述  ：PZ-ESP8266模块进行AP TCP Server测试
 * 输入  ：无
 * 返回  : 无
 * 调用  ：被外部调用
 */
void ESP8266_AP_TCP_Server ( void )
{
	char cStrInput [100] = { 0 }, * pStrDelimiter [3], * pBuf, * pStr;
	u8 uc = 0;
  u32 ul = 0;

  ESP8266_Choose ( ENABLE );

	ESP8266_AT_Test ();
	
	ESP8266_Net_Mode_Choose ( AP );


	PC_Usart ( "\r\n请输入要创建的WiFi的名称、加密方式和密钥，加密方式的编号为：\
              \r\n0 = OPEN\
              \r\n1 = WEP\
              \r\n2 = WPA_PSK\
	            \r\n3 = WPA2_PSK\
              \r\n4 = WPA_WPA2_PSK\
							\r\n输入格式为：名称字符+英文逗号+加密方式编号+英文逗号+密钥字符+空格，点击发送\r\n" );

	scanf ( "%s", cStrInput );

	PC_Usart ( "\r\n稍等片刻 ……\r\n" );

	pBuf = cStrInput;
	uc = 0;
	while ( ( pStr = strtok ( pBuf, "," ) ) != NULL )
	{
		pStrDelimiter [ uc ++ ] = pStr;
		pBuf = NULL;
	} 
	
	ESP8266_BuildAP ( pStrDelimiter [0], pStrDelimiter [2], pStrDelimiter [1] );
	ESP8266_Cmd ( "AT+RST", "OK", "ready", 2500 ); //*
		

	ESP8266_Enable_MultipleId ( ENABLE );
		
	
	PC_Usart ( "\r\n请输入服务器要开启的端口号和超时时间（0~28800，单位：秒），输入格式为：端口号字符+英文逗号+超时时间字符+空格，点击发送\r\n" );

	scanf ( "%s", cStrInput );

	PC_Usart ( "\r\n稍等片刻 ……\r\n" );

	pBuf = cStrInput;
	uc = 0;
	while ( ( pStr = strtok ( pBuf, "," ) ) != NULL )
	{
		pStrDelimiter [ uc ++ ] = pStr;
		pBuf = NULL;
	} 

	ESP8266_StartOrShutServer ( ENABLE, pStrDelimiter [0], pStrDelimiter [1] );
	
	
	do
	{
		PC_Usart ( "\r\n正查询本模块IP……\r\n" );
	  ESP8266_Cmd ( "AT+CIFSR", "OK", "Link", 500 );
		
		PC_Usart ( "\r\n请用手机连接刚才创建的WiFi，这里只连接一个手机，作为ID0，然后用手机网络调试助手以TCP Client连接刚才开启的服务器（AP IP）……\r\n" );
		delay_ms ( 20000 ) ;
	}	while ( ! ESP8266_Cmd ( "AT+CIPSTATUS", "+CIPSTATUS:0", 0, 500 ) );
	

	PC_Usart ( "\r\n请输入要向端口手机（ID0）发送的字符串，输入格式为：字符串（不含空格）+空格，点击发送\r\n" );

	scanf ( "%s", cStrInput );

	ul = strlen ( cStrInput );
	
	ESP8266_SendString ( DISABLE, cStrInput, ul, Multiple_ID_0 );

	
	PC_Usart ( "\r\n请在手机网络调试助手发送字符串\r\n" );
	while (1)
	{
	  pStr = ESP8266_ReceiveString ( DISABLE );
		PC_Usart ( "%s", pStr );
	}

}


/*
 * 函数名：ESP8266_StaTcpClient_ApTcpServer
 * 描述  ：PZ-ESP8266模块进行STA(TCP Client)+AP(TCP Server)测试
 * 输入  ：无
 * 返回  : 无
 * 调用  ：被外部调用
 */
void ESP8266_StaTcpClient_ApTcpServer ( void )
{
	char cStrInput [100] = { 0 }, * pStrDelimiter [3], * pBuf, * pStr;
	u8 uc = 0;
  u32 ul = 0;

  ESP8266_Choose ( ENABLE );

	ESP8266_AT_Test ();
	
	ESP8266_Net_Mode_Choose ( STA_AP );


	PC_Usart ( "\r\n请输入要创建的WiFi的名称、加密方式和密钥，加密方式的编号为：\
						\r\n0 = OPEN\
						\r\n1  =WEP\
						\r\n2 = WPA_PSK\
						\r\n3 = WPA2_PSK\
						\r\n4 = WPA_WPA2_PSK\
						\r\n输入格式为：名称字符+英文逗号+加密方式编号+英文逗号+密钥字符+空格，点击发送\r\n" );

	scanf ( "%s", cStrInput );

	PC_Usart ( "\r\n稍等片刻 ……\r\n" );

	pBuf = cStrInput;
	uc = 0;
	while ( ( pStr = strtok ( pBuf, "," ) ) != NULL )
	{
		pStrDelimiter [ uc ++ ] = pStr;
		pBuf = NULL;
	} 
	
	ESP8266_BuildAP ( pStrDelimiter [0], pStrDelimiter [2], pStrDelimiter [1] );
	ESP8266_Cmd ( "AT+RST", "OK", "ready", 2500 ); //*
	

	ESP8266_Cmd ( "AT+CWLAP", "OK", 0, 5000 );
		
  do
	{
		PC_Usart ( "\r\n请输入要连接的WiFi名称和密钥，输入格式为：名称字符+英文逗号+密钥字符+空格，点击发送\r\n" );

		scanf ( "%s", cStrInput );

		PC_Usart ( "\r\n稍等片刻 ……\r\n" );

		pBuf = cStrInput;
		uc = 0;
		while ( ( pStr = strtok ( pBuf, "," ) ) != NULL )
		{
			pStrDelimiter [ uc ++ ] = pStr;
			pBuf = NULL;
		} 
		
  } while ( ! ESP8266_JoinAP ( pStrDelimiter [0], pStrDelimiter [1] ) );

	
	ESP8266_Enable_MultipleId ( ENABLE );
		
	
	PC_Usart ( "\r\n请输入服务器要开启的端口号和超时时间（0~28800，单位：秒），输入格式为：端口号字符+英文逗号+超时时间字符+空格，点击发送\r\n" );

	scanf ( "%s", cStrInput );

